app/controllers/contributions_controller.rb

  def create

    story = Story.find(params[:story_id])
    # If you used associations here you would not have to
    # take this extra step below:
    # `contribution = story.contributions.build(contribution_params)`
    # So it is associated with the story as soon as it saves
    # and it also updates the association in memory.
    contribution = Contribution.new(contribution_params)

    if contribution.save
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 336]]
INSERT INTO "contributions" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "something"], ["created_at", "2015-05-15 06:56:46.876017"], ["updated_at", "2015-05-15 06:56:46.876017"]]