app/controllers/stories_controller.rb

  def create
    new_story = Story.new(title: story_params[:title], contribution_limit: story_params[:contribution_limit])
    new_location = Location.new(lat: story_params[:lat], lng: story_params[:lng])
    if new_story.save
---
INSERT INTO "stories" ("title", "contribution_limit", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Supernatural Winnipeg"], ["contribution_limit", 12], ["completed", "f"], ["created_at", "2015-05-15 04:27:22.714149"], ["updated_at", "2015-05-15 04:27:22.714149"]]