app/controllers/stories_controller.rb

SELECT "contributions".* FROM "contributions" WHERE "contributions"."story_id" = $1  [["story_id", 1]]
---
  def show
    story = Story.find(params[:id])
    all_contributions = story.contributions
    last_contribution = story.contributions.last
    if story.completed
      render json: {
        id: story.id,
        title: story.title,
        lat: story.location.lat,
        lng: story.location.lng,
        completed: story.completed,
        contribution_limit: story.contribution_limit,
        contributions_length: story.contributions.length,
        all_contributions: all_contributions