app/controllers/stories_controller.rb

  def index
    render json: Story.all
---
SELECT "stories".* FROM "stories"

  def create
    new_story = Story.new(title: story_params[:title], contribution_limit: story_params[:contribution_limit])
    new_location = Location.new(lat: story_params[:lat], lng: story_params[:lng])
    if new_story.save
---
INSERT INTO "stories" ("title", "origin_latitude", "origin_longitude", "contribution_limit", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    story = Story.find(params[:id])
    all_contributions = story.contributions
    last_contribution = story.contributions.last
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "contributions".* FROM "contributions" WHERE "contributions"."story_id" = $1  ORDER BY "contributions"."id" DESC LIMIT 1  [["story_id", 1]]